Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: སྐྱེ་མཆེད་དྲུག་སྤང་བར་འདུ་ཤེས་པ་དང་། རེག་པར་འདུ་ཤེས་པ་དང་། རེག་པ་སྤང་བར་འདུ་ཤེས་པ་དང་། ཚོར་བར་འདུ་ཤེས་པ་དང་། ཚོར་བ་སྤང་བར་འདུ་ཤེས་པ་དང་། སྲེད་པར་འདུ་ཤེས་པ་དང་། སྲེད་པ་སྤང་བར་འདུ་ཤེས་པ་དང་། ལེན་པར་འདུ་ཤེས་པ་དང་། ལེན་པ་སྤང་བར་འདུ་ཤེས་པ་དང་། སྲིད་པར་འདུ་ཤེས་པ་དང་། སྲིད་པ་སྤང་བར་འདུ་ཤེས་པ་དང་། སྐྱེ་བར་འདུ་ཤེས་པ་དང་། སྐྱེ་བ་སྤང་བར་འདུ་ཤེས་པ་དང་། རྒ་ཤིར་འདུ་ཤེས་པ་དང་། རྒ་ཤི་སྤང་བར་འདུ་ཤེས་པ་དང་། མྱ་ངན་དང་སྨྲེ་སྔགས་འདོན་པར་འདུ་ཤེས་པ་དང་། མྱ་ངན་དང་སྨྲེ་སྔགས་འདོན་པ་སྤང་བར་འདུ་ཤེས་པ་དང་།
en: V: 168} the perception of craving, the perception of abandoning craving, the perception of grasping, the perception of abandoning grasping, the perception of the rebirth process, the perception of abandoning the rebirth process, the perception of actual birth, the perception of abandoning actual birth, the perception of aging and death, the perception of abandoning aging and death, the perception of sorrow and lamentation, and the perception of abandoning sorrow and lamentation? “

source: སྡུག་བསྔལ་དུ་འདུ་ཤེས་པ་དང་། སྡུག་བསྔལ་ཀུན་ཤེས་པར་བྱ་བར་འདུ་ཤེས་པ་དང་། ཀུན་འབྱུང་བར་འདུ་ཤེས་པ་དང་། ཀུན་འབྱུང་བ་སྤང་བར་འདུ་ཤེས་པ་དང་། འགོག་པར་འདུ་ཤེས་པ་དང་།
en: Do they have the perception of suffering, the perception that all suffering is to be known, the perception of the origin of suffering, the perception that the origin of suffering is to be abandoned, the perception of the cessation [of suffering], the perception that the cessation [of suffering] is to be actualized, the perception of the path, and the perception that the path is to be cultivated? “

source: འགོག་པ་མངོན་དུ་བྱ་བར་འདུ་ཤེས་པ་དང་། ལམ་དུ་འདུ་ཤེས་པ་དང་། ལམ་བསྒོམ་པར་འདུ་ཤེས་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འདུ་ཤེས་པ་འམ། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤང་བར་འདུ་ཤེས་པའི་བར་དུ་མཆིས་སམ།
en: Do they have the perception of all-aspect omniscience, or [other perceptions], up to and including the perception of abandoning all afflicted mental states associated with reincarnation through the continuity of propensities?” “

source: རབ་འབྱོར་དེ་ནི་མེད་དོ། །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་གང་ལ་ཡང་དངོས་པོ་ཡོད་པར་འདུ་ཤེས་པ་འམ། དངོས་པོ་མེད་པར་འདུ་ཤེས་པ་མེད་དོ། །གང་ལ་དངོས་པོ་ཡོད་པར་འདུ་ཤེས་པ་དང་།
en: Subhūti, when bodhisattva great beings practice the perfection of wisdom, they are without the perception of entities and the perception of nonentities with respect to anything at all.

source: དངོས་པོ་མེད་པར་འདུ་ཤེས་པ་མེད་པ་དེ་ཉིད་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འཐུན་པའི་བཟོད་པའོ།
en: That very state in which they are without the perception of entities and the perception of nonentities is the appropriate receptivity of bodhisattva great beings.

source: །གང་ལ་དངོས་པོ་ཡོད་པར་འདུ་ཤེས་པ་དང་། དངོས་པོ་མེད་པར་འདུ་ཤེས་པ་མེད་པ་དེ་ཉིད་ནི་ལམ་བསྒོམ་པའོ།
en: That very state in which they are without the perception of entities and the perception of nonentities is the cultivation of the path.

source: །གང་ལ་དངོས་པོ་ཡོད་པར་འདུ་ཤེས་པ་དང་། དངོས་པོ་མེད་པར་འདུ་ཤེས་མེད་པ་དེ་ཉིད་ནི་འབྲས་བུའོ།
en: That very state in which they are without the perception of entities and the perception of nonentities is the fruit.

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལམ་ནི་དངོས་པོ་མེད་པ་སྟེ།
en: Subhūti, the path of bodhisattva great beings is nonentity.

source: མངོན་པར་རྟོགས་པ་ཡང་དངོས་པོ་མེད་པའོ།
en: Clear realization is also nonentity.

source: །རབ་འབྱོར་དེ་ལྟར་རྣམ་གྲངས་དེས་ཀྱང་། འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དུ་རིག་པར་བྱའོ།
en: For this reason, Subhūti, one should know that all phenomena are of the essential nature of nonentity.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་ཆོས་ཐམས་ཅད་དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་ལགས་ན། བཅོམ་ལྡན་འདས་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་དུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་གྱུར་ཏེ།
en: Blessed Lord, if in that manner all phenomena are of the essential nature of nonentity, in that case, Blessed Lord, how do the tathāgatas attain consummate buddhahood with respect to all phenomena that are of the essential nature of nonentity?

source: དེ་དག་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པས་ཆོས་ཐམས་ཅད་ལ་མངའ་བསྒྱུར་བའི་ཡུལ་ལ་མངའ་བརྙེས་པར་གྱུར། དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: How, by attaining consummate buddhahood, do they acquire sovereignty over their perceptual range, which is sovereignty over all phenomena?”

source: །རབ་འབྱོར་འདི་ལ་ང་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་ཅིང་། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། འདོད་པས་དབེན་སྡིག་ཏོ་མི་དགེ་བའི་ཆོས་ཀྱིས་དབེན་པ། རྟོག་པ་དང་བཅས་པ་དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན།
en: The Blessed One replied to the venerable Subhūti, “In this regard, Subhūti, when I was formerly engaged in the conduct of a bodhisattva, practicing the six perfections, I achieved and maintained the first meditative concentration, where there is freedom from desires, and freedom from negative and nonvirtuous attributes, while ideation and scrutiny are present, alongside the joy and bliss that arise from that freedom.

source: བསམ་གཏན་དང་པོ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་སོ། །བསམ་གཏན་བཞི་པའི་བར་ལ་ཉེ་བར་བསྒྲུབས་ཤིང་གནས་པར་གྱུར་ཏེ།
en: I achieved and maintained [the other meditative concentrations], up to and including the fourth meditative concentration.

source: འོན་ཀྱང་ངས་བསམ་གཏན་དེ་དག་དང་། བསམ་གཏན་གྱི་ཡན་ལག་དེ་དག་གི་མཚན་མ་བཟུང་སྟེ།
en: But I did not grasp the signs of these meditative concentrations or the ancillary aspects of these meditative concentrations.

source: བསམ་གཏན་དེ་དག་གིས་བསྙེམས་པར་མ་གྱུར།
en: I did not give rise to conceits on account of those meditative concentrations.

source: བསམ་གཏན་གྱི་རོ་མྱོང་བར་མ་གྱུར།
en: I did not relish the taste of meditative concentration.

source: བསམ་གཏན་དུ་དམིགས་པར་མ་གྱུར་ཏེ།
en: I did not apprehend meditative concentration.

source: དེ་ལྟར་ན་ངས་བསམ་གཏན་དེ་དག་རྣམ་པ་ཡོངས་སུ་དག་པ་ལ་མཉམ་པར་གཞག་གོ །
en: In that manner I became absorbed in these meditative concentrations and their pure aspects.

source: དེ་ལྟར་ངས་བསམ་གཏན་དེ་དག་རྣམ་པར་སྨིན་པར་བྱས་ནས། ལྷའི་མིག་ཤེས་པ་རྣམ་པ་ཐ་དད་པ་མངོན་དུ་བྱ་བའི་ཕྱིར། སེམས་གཞོལ་བར་བྱ།
en: In that manner I brought those meditative concentrations to maturity, and henceforth I would focus my mind on actualizing the different modes of the knowledge of clairvoyance.

source: ལྷའི་རྣ་བ་ཤེས་པ་མངོན་དུ་བྱ་བའི་ཕྱིར། སེམས་གཞོལ་བར་བྱ།
en: I would focus my mind on actualizing the knowledge of clairaudience.

source: ཕ་རོལ་གྱི་སེམས་ཤེས་པ་མངོན་དུ་བྱ་བའི་ཕྱིར། སེམས་གཞོལ་བར་བྱ།
en: I would focus my mind on actualizing the knowledge of other minds.

source: སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་ཤེས་པ་མངོན་དུ་བྱ་བའི་ཕྱིར། སེམས་གཞོལ་བར་བྱ། ལྷའི་མིག་གི་ཤེས་པ་མངོན་དུ་བྱ་བའི་ཕྱིར།
en: I would focus my mind on actualizing the knowledge of recollecting past lives.{Ki.

source: སེམས་གཞོལ་བར་བྱ། འོན་ཀྱང་ངས་མངོན་པར་ཤེས་པ་མངོན་དུ་བྱ་བ་དེ་དག་ལ་མཚན་མར་བཟུང་སྟེ།
en: V: 169} However, I did not conceptualize those extrasensory powers that were to be brought into being.

source: མངོན་པར་ཤེས་པ་དེ་དག་གིས་ཤེས་པར་མ་གྱུར།
en: I was not cognizant of these extrasensory powers.

source: རོ་མྱོང་བར་མ་གྱུར། དམིགས་པར་མ་གྱུར་ཏེ།
en: I did not relish their taste, and I did not apprehend them.

source: མངོན་པར་ཤེས་པ་ལྔ་པོ་དེ་དག་ནམ་མཁའ་ལྟ་བུར་ཡང་དག་པར་རྗེས་སུ་དྲན་པས་མཉམ་པར་གཞག་སྟེ།
en: I remained absorbed, recollecting that these five extrasensory powers resemble space.

source: དེ་ལྟར་ངས་སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་ཤེས་རབ་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། འདི་ནི་སྡུག་བསྔལ་ལོ། །འདི་ནི་སྡུག་བསྔལ་ཀུན་འབྱུང་བའོ། །འདི་ནི་སྡུག་བསྔལ་འགོག་པའོ། །འདི་ནི་སྡུག་བསྔལ་འགོག་པར་འགྱུར་བའི་ལམ་མོ། །ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་ཤེས་པར་གྱུར་ཏེ།
en: In this way I attained consummate buddhahood in unsurpassed, complete enlightenment through the wisdom of a single instant, and then I definitively comprehended that this is suffering, this is the origin [of suffering], this is the cessation of suffering, and this is the path that brings about the cessation of suffering.

source: དེ་ལྟར་ང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་ལྡན་པར་གྱུར། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་།
en: So it was that I acquired the ten powers of the tathāgatas, and I acquired the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas, consequent on which I could then predict the three categories into which beings would fall.” “

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་དང་ལྡན་པར་གྱུར་ནས། སེམས་ཅན་རྣམས་ཕུང་པོ་གསུམ་དུ་ལུང་བསྟན་པར་གྱུར་ཏོ། །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་ཀྱི་བསམ་གཏན་བཞི་བསྐྱེད་པར་གྱུར།
en: Blessed Lord, how did the tathāgata, arhat, completely awakened Buddha develop the four meditative concentrations, which are of the essential nature of nonentity?

source: ཇི་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་མངོན་པར་མཁྱེན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་བསྐྱེད་པར་གྱུར།
en: How did he develop the six perfections, the extrasensory powers, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas?

source: སེམས་ཅན་རྣམས་ཀྱང་སེམས་ཅན་མ་མཆིས་པར་ཇི་ལྟར་ཕུང་པོ་གསུམ་དུ་ལུང་བསྟན་པར་གྱུར། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གལ་ཏེ་འདོད་པ་རྣམས་དང་། སྡིག་ཏོ་མི་དགེ་བའི་ཆོས་རྣམས་ལ་དངོས་པོ་ཞིག་ཡོད་དེ། ངོ་བོ་ཉིད་ཡོད་པ་འམ།
en: How did he prophetically declare that beings are classed according to three categories, although beings do not exist?” “

source: གཞན་གྱི་དངོས་པོ་ཞིག་ཡོད་ན་ནི། རབ་འབྱོར་ངས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ། འདོད་པ་རྣམས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དང་། སྡིག་ཏོ་མི་དགེ་བའི་ཆོས་རྣམས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དུ་རིག་ནས། བསམ་གཏན་བཞི་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་པར་ཡང་མི་འགྱུར་ཏེ། རབ་འབྱོར་འདི་ལྟར་འདོད་པ་རྣམས་དང་། སྡིག་ཏོ་མི་དགེ་བའི་ཆོས་རྣམས་ལ་དངོས་པོ་མེད་པ་ངོ་བོ་ཉིད་མེད་པ། གཞན་གྱིས་དངོས་པོ་མེད་པ་སྟེ། གཞན་དུ་ན་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཡིན་པས།
en: Subhūti,” replied the Blessed One, “if desires and negative, nonvirtuous attributes had an entity, had an essential nature, or had some extraneous entity, then, Subhūti, when I formerly practiced the conduct of a bodhisattva, I would not even have achieved and maintained the four meditative concentrations, knowing that desires are of the essential nature of nonentity and that negative, nonvirtuous attributes are of the essential nature of nonentity.

source: རབ་འབྱོར་དེའི་ཕྱིར་ང་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ། འདོད་པས་དབེན་སྡིག་ཏོ་མི་དགེ་བའི་ཆོས་ཀྱིས་དབེན་པ། རྟོག་པ་དང་བཅས་པ། དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་པར་གྱུར་ཏོ།
en: So, Subhūti, since desires and negative, nonvirtuous attributes are without entity, without essential nature, and without extraneous entity, and moreover their essential nature is nonentity, for that reason, Subhūti, when I practiced the conduct of a bodhisattva, I achieved and maintained the first meditative concentration, where there is freedom from desires, and freedom from negative and nonvirtuous attributes, while ideation and scrutiny are present, alongside the joy and bliss that arise from that freedom.

source: །བསམ་གཏན་བཞི་པའི་བར་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་པར་གྱུར་ཏོ།
en: I achieved and maintained [the other meditative concentrations], up to and including the fourth meditative concentration. “

source: །རབ་འབྱོར་གལ་ཏེ་མངོན་པར་ཤེས་པ་རྣམས་ལ་དངོས་པོ་ཞིག་ཡོད་དེ་ངོ་བོ་ཉིད་ཡོད་པ་འམ། གཞན་གྱི་དངོས་པོ་ཞིག་ཡོད་ན་ནི། རབ་འབྱོར་ངས་ཀྱང་མངོན་པར་ཤེས་པ་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དུ་རིག་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་མི་འགྱུར་ཏེ། རབ་འབྱོར་འདི་ལྟར་མངོན་པར་ཤེས་པ་རྣམས་ལ་དངོས་པོ་མེད་དེ།
en: Subhūti, if the extrasensory powers had an entity, had an essential nature, or had some extraneous entity, then, Subhūti, I would not even have attained consummate buddhahood in unsurpassed, complete enlightenment, knowing that all the extrasensory powers are of the essential nature of nonentity.

source: ངོ་བོ་ཉིད་མེད་པ། གཞན་གྱི་དངོས་པོ་མེད་པ་སྟེ། གཞན་དུ་ན་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཡིན་པས་དེའི་ཕྱིར། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་མངོན་པར་ཤེས་པ་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དུ་ཐུགས་སུ་ཆུད་དེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: So, Subhūti, since the extrasensory powers are without entity, without essential nature, and without extraneous entity, and moreover, since their essential nature is nonentity, it is for this reason that I, as a tathāgata, arhat, completely awakened buddha, comprehended that all the extrasensory powers are of the essential nature of nonentity, and attained consummate buddhahood in unsurpassed, complete enlightenment.

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་ལ། བསམ་གཏན་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་ན། བཅོམ་ལྡན་འདས་དེའི་སླད་དུ་ཆོས་ཐམས་ཅད་དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་ལ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཐར་གྱིས་སྤྱོད་པ་དང་། མཐར་གྱིས་སློབ་པ་དང་། མཐར་གྱིས་ནན་ཏན་དུ་བགྱི་བ་གང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བའི་མཐར་གྱིས་སྤྱོད་པ་དང་། མཐར་གྱིས་སློབ་པ་དང་། མཐར་གྱིས་ནན་ཏན་དུ་བགྱི་བ་མཆིས་པར་གྱུར།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་དྲུག་ཅུ་བཞི་པ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཐོག་མར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་དང་། སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བའི་དགྲ་བཅོམ་པ་དག་དང་། ཕྱིར་མི་འོང་བ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། རྒྱུན་དུ་ཞུགས་པ་དག་ལས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དང་། རང་སངས་རྒྱས་རྣམས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དང་། དགྲ་བཅོམ་པ་རྣམས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དང་། ཕྱིར་མི་འོང་བ་རྣམས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་རྣམས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དང་། རྒྱུན་དུ་ཞུགས་པ་རྣམས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དང་། འཕགས་པ་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དང་། འདུ་བྱེད་རྣམས་ཀྱི་ངོ་བོ་ཉིད་ཆུང་ངུ་ན། སྐྲའི་རྩེ་མོའི་ཆ་ཤས་ཀྱི་གནས་ཙམ་ཡང་མེད་དོ་ཞེས་བྱ་བར་ཐོས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་ཇི་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱང་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། དགྲ་བཅོམ་པ་རྣམས་དང་། ཕྱིར་མི་འོང་བ་རྣམས་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་རྣམས་དང་།
en: VI: 1} Subhūti then asked, “Blessed Lord, if bodhisattva great beings in that manner attain consummate buddhahood in unsurpassed, complete enlightenment by means of the four meditative concentrations and the five extrasensory powers, although all phenomena have the essential nature of nonentity, why is it, Blessed Lord, that bodhisattva great beings undertake the serial practice, serial training, and serial progression through which they will attain manifest perfect buddhahood in unsurpassed, complete enlightenment, despite the fact that all phenomena are of the essential nature of nonentity?” “

source: རྒྱུན་དུ་ཞུགས་པ་རྣམས་ཀྱང་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཡིན་ན། གལ་ཏེ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱང་རུང་། གལ་ཏེ་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་ཀྱང་རུང་སྟེ། ཆོས་ཐམས་ཅད་ནི་དངོས་པོ་མེད་པ་ཉིད་ཡིན་གྱིས། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་བྱ་སྟེ། སེམས་ཅན་དངོས་པོའི་འདུ་ཤེས་ཅན་ལ་སྤྱོད་པ་ཐམས་ཅད་དངོས་པོ་མེད་པ་ལ་རབ་ཏུ་དགོད་པར་བྱའོ་སྙམ་སྟེ།
en: Subhūti,” replied the Blessed One, “bodhisattva great beings hear in the beginning from the lord buddhas, bodhisattva great beings, arhats who revere many buddhas, those who are no longer subject to rebirth, those who are destined for only one more rebirth, and those entering the stream to nirvāṇa that the lord buddhas have the essential nature of nonentity, that bodhisattva great beings have the essential nature of nonentity, that pratyekabuddhas have the essential nature of nonentity, that arhats have the essential nature of nonentity, that those who are no longer subject to rebirth have the essential nature of nonentity, that those who are destined for only one more rebirth have the essential nature of nonentity, that those entering the stream to nirvāṇa have the essential nature of nonentity, that all the noble ones have the essential nature of nonentity, and that, at the very least, formative predispositions are without any essential nature at all, even to the extent of a hair-tip, whereupon those bodhisattva great beings think, ‘If even the lord buddhas have the essential nature of nonentity, and bodhisattva great beings, arhats, those who are destined for only one more rebirth, and those entering the stream to nirvāṇa have the essential nature of nonentity, in that case, whether I attain consummate buddhahood in unsurpassed, complete enlightenment, or whether I do not attain consummate buddhahood, I should attain consummate buddhahood in unsurpassed, complete enlightenment based on the fact that all phenomena are without essential nature, and then by whatever means I should establish all beings who engage in the perception of entities in nonentity.’ “

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བའི་ཕྱིར། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཇུག་སྟེ། མཐར་གྱིས་སྤྱོད་པ་དང་། མཐར་གྱིས་བསླབ་པ་དང་།
en: Subhūti, those bodhisattva great beings manifestly set out for unsurpassed, complete enlightenment in order that all beings might attain final nirvāṇa.

source: མཐར་གྱིས་ནན་ཏན་དུ་བྱ་བ་གང་ལ་བསླབས་ཤིང་།
en: They should undertake the serial practice, serial training, {Ki.

source: སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་གྱུར་པ་དེ་ལྟ་བུའི་མཐར་གྱིས་སྤྱོད་པ་དང་། མཐར་གྱིས་བསླབ་པ་དང་། མཐར་གྱིས་ནན་ཏན་དུ་བྱ་བ་རྩོམ་མོ། །དེ་ཐོག་མར་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: VI: 2} and serial progress in which bodhisattva great beings of the past have trained and attained consummate buddhahood in unsurpassed, complete enlightenment. “

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་དོ།
en: In the beginning they should practice the six perfections, namely, the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom. “

source: །དེ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བདག་ཀྱང་སྦྱིན་པ་ཡོངས་སུ་གཏོང་ངོ་། །ཕ་རོལ་ཀྱང་སྦྱིན་པ་ལ་རབ་ཏུ་འཇོག་གོ །
en: When they practice the perfection of generosity, they themselves dispense gifts, and they also establish others in generosity.

source: སྦྱིན་པའི་ལེགས་པ་རྗོད་དོ། །སེམས་ཅན་གཞན་གང་། སྦྱིན་པ་ཡོངས་སུ་གཏོང་བ་དེ་དག་གི་ཡང་ལེགས་པ་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་དོ།
en: They praise generosity and also praise and take empathetic delight in other beings dispensing gifts.

source: །དེ་སྦྱིན་པ་དེས་སྐྱིད་པ་ཆེན་པོའི་ཚོགས་ཐོབ་པར་གྱུར་ཏེ། སྐྱོན་དང་སེར་སྣ་མེད་པའི་སེམས་ཀྱིས་སྦྱིན་པ་བྱིན་པར་བྱ་བ་དང་། སྦྱིན་པ་ཡོངས་སུ་གཏོང་བར་བྱེད་དེ། ཟས་འདོད་པ་ལ་ནི་ཟས། སྐོམ་འདོད་པ་ལ་ནི་སྐོམ། བཞོན་པ་འདོད་པ་ལ་ནི་བཞོན་པ། གོས་འདོད་པ་ལ་ནི་གོས། སྤོས་འདོད་པ་ལ་ནི་སྤོས། ཕྲེང་བ་འདོད་པ་ལ་ནི་ཕྲེང་བ།
en: Having acquired great felicity through that generosity, they should dispense their gifts with a mind that is free from faults and free from miserliness.

source: བྱུག་པ་འདོད་པ་ལ་ནི་བྱུག་པ། མལ་ཆ་འདོད་པ་ལ་ནི་མལ་ཆ། གནས་འདོད་པ་ལ་ནི་གནས། མར་མེ་འདོད་པ་ལ་ནི་མར་མེ་གཏོང་བ་ནས། མིའི་ཡོ་བྱད་གང་ཅི་ཡང་རུང་བ་དག་ཀྱང་དེ་དག་ལ་གཏོང་བའི་བར་དུ་སྟེ།
en: They dispense their gifts in the following way: they give food to those who need food, drink to those who need drink, transport to those who need transport, clothing to those who need clothing, incense to those who need incense, garlands to those who need garlands, unguents to those who need unguents, bedding to those who need bedding, asylum to those who need asylum, lamps who need lamps, and [everything else], up to and including any of the necessities of humankind, whatever they happen to be. “

source: སྦྱིན་པ་དེ་ཉིད་ཀྱིས་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །ལྷའི་ཆེ་བ་ཉིད་དང་། མིའི་ཆེ་བ་ཉིད་རབ་ཏུ་ཐོབ་པར་བྱེད་དོ།
en: On the basis of that generosity they perfect the aggregate of ethical discipline, and they acquire an exalted status among gods and an exalted status among human beings.

source: །དེ་སྦྱིན་པ་དང་ཚུལ་ཁྲིམས་དེ་ཉིད་ཀྱིས་ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་རབ་ཏུ་ཐོབ་པར་བྱེད་དོ།
en: On the basis of that generosity and ethical discipline, they acquire the aggregate of meditative stability.

source: །དེ་སྦྱིན་པ་དང་ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་དེ་ཉིད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕུང་པོ་རབ་ཏུ་ཐོབ་པར་བྱེད་དོ། །དེ་སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་དང་།
en: On the basis of that generosity, ethical discipline, and meditative stability, they acquire the aggregate of wisdom.

source: ཤེས་རབ་དེ་ཉིད་ཀྱིས་རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་རབ་ཏུ་ཐོབ་པར་བྱེད་དོ། །དེ་སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་།
en: On the basis of that generosity, ethical discipline, meditative stability, and wisdom, they acquire the aggregate of liberation.

source: རྣམ་པར་གྲོལ་བ་དེ་ཉིད་ཀྱིས། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོ་རབ་ཏུ་ཐོབ་པར་བྱེད་དོ། །དེ་སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་དང་།
en: On the basis of that generosity, ethical discipline, meditative stability, wisdom, and liberation, they acquire the aggregate of seeing the wisdom of liberation.

source: ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་དེ་ཉིད་ཀྱིས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདས་ནས། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་གོ །
en: On the basis of that generosity, ethical discipline, meditative stability, wisdom, liberation, and seeing the wisdom of liberation, they transcend the levels of the śrāvakas and pratyekabuddhas, and then enter a bodhisattva’s full maturity.

source: བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་ཞུགས་ནས། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱས། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱེད་དོ།
en: Having entered into the maturity of the bodhisattvas, they refine the buddhafields, bring beings to maturity, and attain all-aspect omniscience.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་ནས། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་རོ།
en: Having attained all-aspect omniscience, they turn the wheel of the Dharma.

source: །ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ནས། སེམས་ཅན་རྣམས་ཐེག་པ་གསུམ་ལ་སོ་སོར་འགོད་ཅིང་། འཁོར་བ་ལས་ཡོངས་སུ་གྲོལ་བར་བྱེད་དོ།
en: Having turned the wheel of the Dharma, they establish beings individually in the three vehicles, and liberate them from cyclic existence.

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པས་མཐར་གྱིས་སྤྱོད་པ་ཡོད་པ་ཡིན་ཏེ། དེ་ཐམས་ཅད་ཀྱང་དམིགས་སུ་མེད་དོ།
en: It is in this way, Subhūti, that although bodhisattva great beings do have their serial practice of generosity, all of it is nonapprehended. {

source: དེ་ནི་འདི་ལྟར་དེ་ལ་ངོ་བོ་ཉིད་མེད་དོ།
en: VI: 3} If you ask why, it is because it is in this way without essential nature. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། བདག་ཀྱང་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །གཞན་ཡང་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་བསྐུལ་ལོ།
en: Moreover, Subhūti, bodhisattva great beings, commencing from the time when they first begin to set their mind on enlightenment, themselves practice the perfection of ethical discipline, and they also encourage others toward the perfection of ethical discipline.
